In [33]:
import seaborn as sns
import pandas as pd
import numpy as np

In [59]:
df=sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [24]:
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [25]:
df.shape

(891, 15)

### Remove the records that have missing values

In [26]:
del_missing_rec=df.dropna()

In [27]:
del_missing_rec.shape

(182, 15)

### Remove the columns that have missing values

In [28]:
del_missing_col=df.dropna(axis=1)

In [30]:
del_missing_col.shape

(891, 11)

### Imputation missing Values

#### Fill with Mean

In [37]:
df.head()
mean_age=np.mean(df['age'])

In [35]:
fill_with_mean=df
fill_with_mean.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [39]:
# lets fill age with our age mean
fill_with_mean.fillna({'age':mean_age},inplace=True)
fill_with_mean.isnull().sum()

survived         0
pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

#### Filling with Median
Prefered when we have right/left skewd distribution, meaning there are outliers

In [42]:
median_age=np.median(df['age'])

In [40]:
fill_with_median=df
fill_with_median.isnull().sum()

survived         0
pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [43]:
# lets fill age with our age median
fill_with_median.fillna({'age':median_age},inplace=True)
fill_with_median.isnull().sum()

survived         0
pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

### Filling with Mode
preferred for categorical variable

In [60]:
mode=df[df['embarked'].notna()]['embarked'].mode()[0]
mode
fill_with_mode=df

In [61]:
fill_with_mode.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [62]:
fill_with_mode.fillna({'embarked':mode},inplace=True)
fill_with_mode.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         0
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64